# Task 1
# Словари Задача «Номер появления слова» Условие  В единственной строке записан текст. Для каждого слова из данного
# текста подсчитайте, сколько раз оно встречалось в этом тексте ранее. Словом считается последовательность не пробельных
# символов идущих подряд, слова разделены одним или большим числом пробелов или символами конца строки.


# found = {}
# for word in input("Enter text:").split():
#     if word not in found:
#         found.setdefault(word, 1)
#     else:
#         found[word] += 1
#
# for k, v in sorted(found.items()):
#     print(k, 'использовалось', v, 'раз(a).')

########################################################################################################################

# Task 2

# dict = {}
# m = 5
# for i in range(5):
#     first = str(input("Введите ключ-значение:"))
#     second = str(input("Введите ключ-значение:"))
#     dict[first] = second
# for k, v in sorted(dict.items()):
#     print(k, "синоним слову", v)

########################################################################################################################

